toy_app/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "samsusng s9"], ["price", 15000.0], ["company_id", 1], ["created_at", "2019-12-25 03:23:13.777354"], ["updated_at", "2019-12-25 03:23:13.777354"]]